<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","label":"test-apply apply_apply_error","backend":"e2b0e4addb05d607c90a46b904d7733bbc631ed0423f6b10f95f4a7db2ddb89b","plan_job_ref":"Job Test terraform-apply #738 at https://github.com/dflook/terraform-github-actions/actions/runs/15321148742","plan_out_hash":"15f3e89bfc094a9737ad08de26efc9e71358f8516352ffbccb4bd9c25d3e25fa","plan_hash":"92019302b33be8c6f561e1acc0291073744bf63034cc93e95420211e166b0e5a","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan for __test-apply apply_apply_error__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.my_bucket will be created
+   resource "aws_s3_bucket" "my_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "hello"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-apply #738](https://github.com/dflook/terraform-github-actions/actions/runs/15321148742)